IDEA Open Model
ConcreteCheckResultOverall Class
Compatible with IDEA StatiCa 20.1
 Concrete check result
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultOverall
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteCheckResultOverall
Public Class ConcreteCheckResultOverall
The ConcreteCheckResultOverall type exposes the following members.
Constructors
Name | Description
ConcreteCheckResultOverall
 Constructor
Top
Properties
Name | Description
Checks
 All check by the type
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace